# SetRestrictPalette Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationNetworkChangeService..::..SetRestrictPalette Method
FabricationNetworkChangeService Class See Also
---
Restrict the placement of parts to only use parts associated to the passed in fabrication palette identifier.
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public void SetRestrictPalette(
	bool restrictPalette
)
```

Visual Basic
---
```text
Public Sub SetRestrictPalette ( _
	restrictPalette As Boolean _
)
```

Visual C++
---
```text
public:
void SetRestrictPalette(
	bool restrictPalette
)
```

# ### Parameters
restrictPalette
    Type: System..::..Boolean
# See Also
FabricationNetworkChangeService Class
Autodesk.Revit.DB.Fabrication Namespace